saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MK02F12810_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MK02F12810_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MK02F12810</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK02F12810" Dvendor="NXP:11">
      <description>The entry-level Kinetis® K02 100 MHz MCU offers a streamlined solution with high performance processing efficiency for very low-power applications.Offers low dynamic power consumption and best-in-class static current consumption with more than 10 flexible low-power modes.Helps extend battery life and reduce overall board power supply requirements.Delivers outstanding computational power for control algorithms, sensor data processing, audio processing while increasing math accuracy and reducing code size.Shares the comprehensive scalability of the Kinetis portfolio.Enables faster time-to-market with comprehensive enablement solutions.</description>
      <device Dname="MK02FN128xxx10">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="100000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK02FN128xxx10_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffe000" size="0x2000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x2000" access="rw" default="1"/>
        <algorithm name="arm/MK_P128.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MK0x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MK02F12810.xml"/>
        <variant Dvariant="MK02FN128VFM10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN128VFM10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN128VFM10/MK02FN128xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK02FN128VLF10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN128VLF10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN128VLF10/MK02FN128xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK02FN128VLH10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN128VLH10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN128VLH10/MK02FN128xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK02FN64xxx10">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="100000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK02FN64xxx10_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffe000" size="0x2000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x2000" access="rw" default="1"/>
        <algorithm name="arm/MK_P64.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MK0x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MK02F12810.xml"/>
        <variant Dvariant="MK02FN64VLH10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN64VLH10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN64VLH10/MK02FN64xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK02FN64VLF10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN64VLF10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN64VLF10/MK02FN64xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK02FN64VFM10">
          <compile header="fsl_device_registers.h" define="CPU_MK02FN64VFM10"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK02FN64VFM10/MK02FN64xxx10_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.edma">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK02F12810_AND_utility.debug_console">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.common">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK02F12810_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MK02F12810_AND_driver.uart">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK02F12810">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MK02F12810_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK02F12810_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK02FN64???10" Dvendor="NXP:11"/>
      <accept Dname="MK02FN128???10" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
